if __name__ == "__main__":
    n = input("Введите сумму от 1 до 100000: ")
    while type(n) is str:
        try:
            n = int(n)
            if not (1 <= n <= 100000):
                raise Exception
        except Exception:
            n = input("Неверно! Введите сумму от 1 до 100000: ")
    # слова без склонения
    number_alphabet = {1: 'один',
                       2: 'два',
                       3: 'три',
                       4: 'четыре',
                       5: 'пять',
                       6: 'шесть',
                       7: 'семь',
                       8: 'восемь',
                       9: 'девять',
                       10: "десять",
                       11: "одиннадцать",
                       12: "двенадцать",
                       13: "тринадцать",
                       14: "четырнадцать",
                       15: "пятнадцать",
                       16: "шестнадцать",
                       17: "семнадцать",
                       18: "восемнадцать",
                       19: "девятнадцать",
                       20: "двадцать"
                       }
    two_digit = {20: "двадцать",
                 30: "тридцать",
                 40: "сорок",
                 50: "пятьдесят",
                 60: "шестьдесят",
                 70: "семьдесят",
                 80: "восемьдесят",
                 90: "девяносто"
                 }
    three_digit = {100: "сто",
                   200: "двести",
                   300: "триста",
                   400: "четыреста",
                   500: "пятьсот",
                   600: "шестьсот",
                   700: "семьсот",
                   800: "восемьсот",
                   900: "девятьсот"
                   }
    # склоняющиеся слова
    thousands = ["тысяча", "тысячи", "тысяч"]
    rubles = ["рубль", "рубля", "рублей"]

    # число разбивается на две части ***.***
